goals_app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "session_token", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @user = User.find_by(id: params[:id])

    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "david"], ["password_digest", "$2a$10$uc5IhEtP9L3HPSPzRxOWpedWVnC2KHlMD8ppq3C0Cod51yUh03PJO"], ["updated_at", "2018-09-14 23:54:42.593822"], ["id", 1]]